snlkuharlocal/src/Documents/ЗаявкаВТранспортныйОтдел/ЗаявкаВТранспортныйОтдел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаВТранспортныйОтдел</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ПоступлениеВЗонуХранения</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставкиОтправитель</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпанияОтправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПерегрузаОтправитель</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставкиПолучатель</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпанияПолучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПерегрузаПолучатель</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияЗаявокВТранспортныйОтдел</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеКоррекции</name>
    <type>
      <types>EnumRef.СостоянияКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ИнформацияШКЛН/ИнформацияШКЛН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияШКЛН</name>
  <attributes>
    <name>НомерЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробкиЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ШКЛистаНабора/ШКЛистаНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШКЛистаНабора</name>
  <resources>
    <name>НомерШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ЗаявкаВТранспортныйОтдел/ObjectModule.bsl
//Кухарь 11.01.19 начало
 //Для отработки коррекция
Процедура ЗаписьБезКонтроляПолномочий ()   экспорт
	если дата>Константы.ДатаЗапретаРедактирования.Получить() тогда
		НеКонтролироватьЗапись = Истина;
	иначе
		НеКонтролироватьЗапись = ложь;
	КонецЕсли;	
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьЗапись = Ложь;	
КонецПроцедуры
 //Кухарь 11.01.19 конец


Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ЗаписатьКоличествоИОбъемКоробовВРегистр (ЭтотОбъект.Ссылка,КоличествоКоробок,ОбъемКоробов);             
	//Кухарь А.Ю.  07.05.2026 начало
	// HELP-9698	
	//СформироватьШКЛистаНабора();         
	если ОбщегоНазначения_ПИ.ЭтоУзел_Склад() тогда
		СформироватьШКЛистаНабора();
	КонецЕсли;
	//Кухарь А.Ю.  07.05.2026 конец
	
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.      
	
	//Кухарь А.Ю.  07.05.2026 начало
	// HELP-9698	        
	СформироватьШКЗНО();
	//Кухарь А.Ю.  07.05.2026 конец
	
	ЕстьИзменения				= Модифицированность();
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;
	//крохин начало  
	//Валетов + 09,06,2026 Наряд 0000001060 Проблема 0000000083
	Если Проведен ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	//крохин конец
	//кухарь 25.05.16 начало
	//Дата авизации в ЗТО
	Если НЕ ОбменДанными.Загрузка и ПараметрыСеанса.ТипУзла= Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда	
		РасчДатаАвизации=ОпределитьДатуАвизацииДокумента(ЭтотОбъект);
		если РасчДатаАвизации<>ДатаПриемки тогда
			УстановитьДатуАвизацииДокумента(ЭтотОбъект.Ссылка,РасчДатаАвизации);
			ДатаПриемки=РасчДатаАвизации;
		КонецЕсли;
	КонецЕсли;
	//кухарь 25.05.16 конец
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Если 1=2 Тогда
			Основание=Документы.ПриходнаяНакладная.СоздатьДокумент();		
		КонецЕсли; 
		
		ДокОснование		= Основание;		
		
		Подразделение		= Основание.Склад.Подразделение;
		
		Отправитель					= Основание.Контрагент;		
		ПунктДоставкиОтправитель    = Основание.ПунктДоставки;
		
		КоличествоДокумента			= Основание.КоличествоДокумента;
		ОбъемДокумента				= Основание.ОбъемДокумента;		
		
		Комментарий 		= "На основании: "+Основание;		
	КонецЕсли;
	//Кухарь 13.12.15 начало
	ШтрихКод="";
	//Кухарь 13.12.15 конец
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор   	= Неопределено;	
	Дата		= Неопределено;	
	Состояние   = Неопределено;	
	
	//Кухарь 13.12.15 начало
	ШтрихКод="";
	//Кухарь 13.12.15 конец
	
КонецПроцедуры

//крохин начало
Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры
//крохин конец

//Кухарь А.Ю.  07.05.2026 начало
// HELP-9698	          
Процедура СформироватьШКЗНО() Экспорт   
	если ЗначениеЗаполнено(ШтрихКод) тогда
		Попытка
			ШтрихКод1=Число(ШтрихКод);
			ШтрихКод1=СтрЗаменить(ШтрихКод," ","");
			если СтрДлина(ШтрихКод1)<>13 тогда
				ШтрихКод="";
			КонецЕсли;
		Исключение
			ШтрихКод="";
		КонецПопытки;
	КонецЕсли;		
	
	если ШтрихКод="" тогда
		ПрефиксШК = Формат(Дата,"ДФ=yy")+Прав(ПараметрыСеанса.ЭтотУзел.Подразделение.ЧисловойКодСклада,3);
		НомерШК=ПолучитьМаксимальныйНомерШКЛН(ПрефиксШК)+1;
		ШКЗНО = ПрефиксШК + (Формат(НомерШК,"ЧЦ=7; ЧДЦ=0; ЧВН=; ЧГ="));
		ШКЗНО=ШКЗНО+КонтрольныйСимволEAN(ШКЗНО,13);
		ШтрихКод=ШКЗНО;
	КонецЕсли;      
	
КонецПроцедуры	
//Кухарь А.Ю.  07.05.2026 конец
	


Процедура СформироватьШКЛистаНабора() Экспорт
	

	//Кухарь А.Ю.  07.05.2026 начало
	// HELP-9698	
	//Попытка
	//	ШтрихКод1=Число(ШтрихКод);
	//	ШтрихКод1=СтрЗаменить(ШтрихКод," ","");
	//	если СтрДлина(ШтрихКод1)<>13 тогда
	//		ШтрихКод="";
	//	КонецЕсли;
	//Исключение
	//	ШтрихКод="";
	//КонецПопытки;
	//	
	//
	//если ШтрихКод="" тогда
	//	ПрефиксШК = Формат(Дата,"ДФ=yy")+Прав(ПараметрыСеанса.ЭтотУзел.Подразделение.ЧисловойКодСклада,3);
	//	НомерШК=ПолучитьМаксимальныйНомерШКЛН(ПрефиксШК)+1;
	//	ШКЗНО = ПрефиксШК + (Формат(НомерШК,"ЧЦ=7; ЧДЦ=0; ЧВН=; ЧГ="));
	//	ШКЗНО=ШКЗНО+КонтрольныйСимволEAN(ШКЗНО,13);
	//	ШтрихКод=ШКЗНО;
	//иначе
	//	ШКЗНО=ШтрихКод;
	//	НомерШК=1;
	//КонецЕсли;      
	ШКЗНО = ШтрихКод;
	НомерШК = 1;
	//Кухарь А.Ю.  07.05.2026 конец
	
	НаборЗаписей = РегистрыСведений.ИнформацияШКЛН.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ШКЛистаНабора.Значение = ШКЗНО;					 
	НаборЗаписей.Отбор.ШКЛистаНабора.Использование = Истина;
	НаборЗаписей.Отбор.Год.Значение= НачалоГода(ТекущаяДата());
	НаборЗаписей.Отбор.Год.Использование = Истина;
	НаборЗаписей.Прочитать();
	
	если НаборЗаписей.Количество()<КоличествоКоробок тогда
		НужноЗаписей=КоличествоКоробок-НаборЗаписей.Количество();
		для сч=1 по НужноЗаписей цикл
			ЗаписатьКоробку(ШКЗНО,НомерШК);
		КонецЦикла;
	ИначеЕсли 
		НаборЗаписей.Количество()=КоличествоКоробок тогда
		Возврат;
	Иначе 
		для сч=КоличествоКоробок по НаборЗаписей.Количество()-1 цикл
			Запись=НаборЗаписей.Получить(НаборЗаписей.Количество()-1);
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;
    
	

	
	
	
КонецПроцедуры


Функция ПолучитьМаксимальныйНомерШКЛН(ПрефиксШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШКЛистаНабора.НомерШК
	|ИЗ
	|	РегистрСведений.ШКЛистаНабора КАК ШКЛистаНабора
	|ГДЕ
	|	ШКЛистаНабора.Подразделение = &Подразделение
	|	И ШКЛистаНабора.Год = &Год
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Год",НачалоГода(Дата));
	Запрос.УстановитьПараметр("Подразделение",ПараметрыСеанса.ЭтотУзел.Подразделение);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Число(Выборка.НомерШК);	
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции

Функция ЗаписатьКоробку(ШКЛистаНабора,НомерШК=1)
	
	
	
	ПрефиксШК = Формат(Дата,"ДФ=yy")+Прав(ПараметрыСеанса.ЭтотУзел.Подразделение.ЧисловойКодСклада,3);
	НомерШК=ПолучитьМаксимальныйНомерШКЛН(ПрефиксШК)+1;
	ШККоробки = ПрефиксШК + (Формат(НомерШК,"ЧЦ=7; ЧДЦ=0; ЧВН=; ЧГ="));
	ШККоробки=ШККоробки+КонтрольныйСимволEAN(ШККоробки,13);

	НаборЗаписей = РегистрыСведений.ШКЛистаНабора.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.подразделение.Использование = Истина;
	НаборЗаписей.Отбор.подразделение.Значение = ПараметрыСеанса.ЭтотУзел.Подразделение;
	НаборЗаписей.Отбор.Год.Использование = Истина;
	НаборЗаписей.Отбор.Год.Значение = НачалоГода(Дата);	
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение;
	Запись.Год = НачалоГода(Дата);
	Запись.НомерШК = НомерШК;
	
	Если  НомерШК > 1000 Тогда
		попытка
			НаборЗаписей.Записать();
		Исключение
			ЗаписатьВЛог("дубль ШК ЛН","Не удалось сделать запись в ШКЛистовНабора "+ЭтотОбъект.Метаданные().Имя+" "+ЭтотОбъект.Номер,"Информация") ;
		КонецПопытки;
	Иначе
		ЗаписатьВЛог("ошибка записи последнего номера ШК ЛН","ШК: "+НомерШК + " .ЛН : " +Номер,"Информация") ;
	КонецЕсли;
	
    	
	НаборЗаписей = РегистрыСведений.ИнформацияШКЛН.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ШК.Значение = ШККоробки;					 
	НаборЗаписей.Отбор.ШКЛистаНабора.Значение= ШКЛистаНабора;
	НаборЗаписей.Отбор.ШКЛистаНабора.Использование = Истина;
	НаборЗаписей.Отбор.ШК.Использование = Истина;
	НаборЗаписей.Очистить();
	
	
	Запись = НаборЗаписей.Добавить();
	Запись.ШК = ШККоробки;
	Запись.ШКЛистаНабора = ШКЛистаНабора;
	Запись.НомерЛН = Номер;
	Запись.ВидНакладной = ЭтотОбъект.Метаданные().Синоним;
	Запись.НомерНакладной = Номер;
	Запись.Количество = 1;
	Запись.ГруппыТоваров = "";
	Запись.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение;
	Запись.КоличествоКоробок = 1;
	запись.НомерКоробкиЛН = 1;
	Запись.НомерКоробки = 1;
	запись.Год=НачалоГода(ТекущаяДата());
	НаборЗаписей.Записать();

КонецФункции

//Кухарь 07.03.19 начало
//Отработка коррекций по ЗТО
Процедура УстановитьСостояниеКоррекции(НовоеСостояниеКоррекции) Экспорт
	Отказ = Ложь;
	Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Если	ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
			НеКонтролироватьЗапись=Истина;
			СостояниеКоррекции=НовоеСостояниеКоррекции;
			Записать();
			НеКонтролироватьЗапись=Ложь;	
		КонецЕсли;
	Иначе
		НеКонтролироватьЗапись=Истина;
		СостояниеКоррекции=НовоеСостояниеКоррекции;
		Записать();
		НеКонтролироватьЗапись=Ложь;
	КонецЕсли;
	
КонецПроцедуры
//Кухарь 07.03.19 конец
